iPig/src/Catalogs/ЖурналЛечения/ЖурналЛечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЖурналЛечения</name>
  <attributes>
    <name>Диагноз</name>
    <type>
      <types>CatalogRef.Диагноз</types>
    </type>
  </attributes>
  <attributes>
    <name>Медикаменты</name>
    <type>
      <types>CatalogRef.Медикаменты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лечение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дозировка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесДозировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесСвиньи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДозаНаСвинью</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейДоВыведения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторноеЛечение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

iPig/src/Catalogs/ЖурналЛечения/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ВесСвиньиПриИзменении(Элемент)   
	Если Объект.ВесДозировки <> 0 Тогда
		Объект.ДозаНаСвинью = (Объект.ВесСвиньи / Объект.ВесДозировки )* Объект.Дозировка;
	КонецЕсли;
КонецПроцедуры
